CSI API ETABS v1

# cDStAustralian_AS4100_2020GetOverwrite Method

---

Retrieves the value of a steel design overwrite item

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetOverwrite(
    	string Name,
    	int Item,
    	ref double Value,
    	ref bool ProgDet
    )

    Function GetOverwrite (
    	Name As String,
    	Item As Integer,
    	ByRef Value As Double,
    	ByRef ProgDet As Boolean
    ) As Integer

    Dim instance As cDStAustralian_AS4100_2020
    Dim Name As String
    Dim Item As Integer
    Dim Value As Double
    Dim ProgDet As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetOverwrite(Name,
    	Item, Value, ProgDet)

    int GetOverwrite(
    	String^ Name,
    	int Item,
    	double% Value,
    	bool% ProgDet
    )

    abstract GetOverwrite :
            Name : string *
            Item : int *
            Value : float byref *
            ProgDet : bool byref -> int

#### Parameters

Name

    Type: SystemString
The name of an existing frame object with a steel frame design procedure

Item

    Type: SystemInt32
This is an integer between 1 and 46, inclusive, indicating the overwrite item
considered

  1. Framing type
  2. Steel type
  3. Consider deflection
  4. Deflection check type
  5. DL deflection limit, L/Value
  6. SDL + LL deflection limit, L/Value
  7. LL deflection limit, L/Value
  8. Total load deflection limit, L/Value
  9. Total-camber limit, L/Value
  10. DL deflection limit, absolute
  11. SDL + LL deflection limit, absolute
  12. LL deflection limit, absolute
  13. Total load deflection limit, absolute
  14. Total camber limit, absolute
  15. Specified camber
  16. Net area to total area ratio
  17. Live load reduction factor
  18. Unbraced length ratio, Major
  19. Unbraced length ratio, Minor
  20. Unbraced length ratio, Lateral Torsional Buckling
  21. Effective length factor, Ke Major Braced
  22. Effective length factor, Ke Minor Braced
  23. Effective length factor, Ke Major Sway
  24. Effective length factor, Ke Minor Sway
  25. Twist restraint factor for LTB (kt)
  26. Lateral rotation restraint factor (kr)
  27. Load height factor for LTB (kl)
  28. Moment coefficient, Cm Major
  29. Moment coefficient, Cm Minor
  30. Moment modification factor, Alpha_m
  31. Slender reduction factor, Alpha_s
  32. Nonsway moment factor, Db Major
  33. Nonsway moment factor, Db Minor
  34. Sway moment factor, Ds Major
  35. Sway moment factor, Ds Minor
  36. Form factor, Kf
  37. Axial capacity correction factor, Kt
  38. Yield stress, Fy
  39. Compressive capacity, Nc
  40. Tensile capacity, Nt
  41. Major bending capacity, Ms33
  42. Minor bending capacity, Ms22
  43. Major bending capacity, Mb33
  44. Major shear capacity, Vu2
  45. Minor shear capacity, Vu3
  46. Demand/capacity ratio limit

Value

    Type: SystemDouble
The value of the considered overwrite item

  1. Framing type
     * **0** \- As specified in preferences
     * **1** \- Moment frame
     * **2** \- Braced frame
  2. Steel type
     * **1** \- Hot rolled
     * **2** \- Hot finished
     * **3** \- Cold form
     * **4** \- Stress relieved
     * **5** \- Lightly welded
     * **6** \- Heavily welded
  3. Consider deflection?
     * 0 = No
     * Any other value = Yes
  4. Deflection check type
     * **0** \- Program Determined
     * **1** \- Ratio
     * **2** \- Absolute
     * **3** \- Both
  5. DL deflection limit, L/Value

Value >= 0; 0 means no check for this item

  6. SDL + LL deflection limit, L/Value

Value >= 0; 0 means no check for this item

  7. LL deflection limit, L/Value

Value >= 0; 0 means no check for this item

  8. Total load deflection limit, L/Value

Value >= 0; 0 means no check for this item

  9. Total-camber limit, L/Value

Value >= 0; 0 means no check for this item

  10. DL deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  11. SDL + LL deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  12. LL deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  13. Total load deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  14. Total-camber limit, absolute

Value >= 0; 0 means no check for this item. [L]

  15. Specified camber

Value >= 0. [L]

  16. Net area to total area ratio

Value >= 0; 0 means use program default value

  17. Live load reduction factor

Value >= 0; 0 means use program determined value

  18. Unbraced length ratio, Major

Value >= 0; 0 means use program determined value

  19. Unbraced length ratio, Minor

Value >= 0; 0 means use program determined value

  20. Unbraced length ratio, Lateral Torsional Buckling

Value >= 0; 0 means use program determined value

  21. Effective length factor, Ke Major Braced

Value >= 0; 0 means use program determined value

  22. Effective length factor, Ke Minor Braced

Value >= 0; 0 means use program determined value

  23. Effective length factor, Ke Major Sway

Value >= 0; 0 means use program determined value

  24. Effective length factor, Ke Minor Sway

Value >= 0; 0 means use program determined value

  25. Twist restraint factor for LTB (kt)

Value >= 0; 0 means use program determined value

  26. Lateral rotation restraint factor (kr)

Value >= 0; 0 means use program determined value

  27. Load height factor for LTB (kl)

Value >= 0; 0 means use program determined value

  28. Moment coefficient, Cm Major

Value >= 0; 0 means use program determined value

  29. Moment coefficient, Cm Minor

Value >= 0; 0 means use program determined value

  30. Moment modification factor, Alpha_m

Value >= 0; 0 means use program determined value

  31. Slender reduction factor, Alpha_s

Value >= 0; 0 means use program determined value

  32. Nonsway moment factor, Db Major

Value >= 0; 0 means use program determined value

  33. Nonsway moment factor, Db Minor

Value >= 0; 0 means use program determined value

  34. Sway moment factor, Bs Major

Value >= 0; 0 means use program determined value

  35. Sway moment factor, Bs Minor

Value >= 0; 0 means use program determined value

  36. Form factor, Kf

Value >= 0; 0 means use program determined value

  37. Axial capacity correction factor, Kt

Value >= 0; 0 means use program determined value

  38. Yield stress, Fy

Value >= 0; 0 means use program determined value [F/L2]

  39. Compressive capacity, Nc

Value >= 0; 0 means use program determined value [F]

  40. Tensile capacity, Nt

Value >= 0; 0 means use program determined value [F]

  41. Major bending capacity, Ms33

Value >= 0; 0 means use program determined value [FL]

  42. Minor bending capacity, Ms22

Value >= 0; 0 means use program determined value [FL]

  43. Minor bending capacity, Mb33

Value >= 0; 0 means use program determined value [FL]

  44. Major shear capacity, Vu2

Value >= 0; 0 means use program determined value [F]

  45. Minor shear capacity, Vu3

Value >= 0; 0 means use program determined value [F]

  46. Demand/capacity ratio limit

Value >= 0; 0 means use program determined value

ProgDet

    Type: SystemBoolean
If this item is True, the specified value is program determined

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double
       Dim ProgDet As Boolean

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'set steel design code
       ret = SapModel.DesignSteel.SetCode("AS 4100:2020")

    'get overwrite item
       ret = SapModel.DesignSteel.Australian_AS4100_2020.GetOverwrite("8", 1, Value, ProgDet)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDStAustralian_AS4100_2020
Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com